{
    "jobs": [
        {
            "job_title": "Investor Relations - Vice President / Senior Vice President",
            "location": "Location: Toronto, Ontario, Canada",
            "description": "iCapital is powering the world’s alternative investment marketplace. Our financial technology platform has transformed how advisors, wealth management firms, asset managers, and banks evaluate and recommend bespoke public and private market strategies for their high-net-worth clients. iCapital services, approximately $222 billion in global client assets invested in 1,778 funds, as of February 2025.\niCapital has been named to the Forbes Fintech 50 for seven consecutive years (2018-2024); a three-time selection by Forbes to its list of Best Startup Employers (2021-2023); and a four-time winner of MMI/Barron’s Solutions Provider award (See link below).\nAbout the Role\niCapital is looking to hire a Senior Vice President to lead the Investor Relations team for our fast-growing business in Canada. This is a fantastic opportunity for someone with the desire to work with a broad range of clients within a fast-paced, collaborative, and entrepreneurial environment. This senior leader will collaborate with our Client Solutions, Product Development, Legal and Compliance, and Client Success teams to introduce new products, enhance current offerings, and assist client operations in Canada. The role assists banks, brokers, dealers, family offices, and small institutions with investments in iCapital managed alternative funds, in addition to GPs looking to enter the Canadian market, providing expert advice and support on best practices. Our goal is to optimize the user experience, provide wholistic client experience management, and ensure our clients’ overall end-to-end success throughout the lifecycle of their investments.\nResponsibilities\n\nLead local team to provide dedicated coverage to GPs, Distributors and Family Offices, assisting them with investments and ongoing support, with a focus on client service excellence.\nWork closely with our local Sales and relationship management teams to ensure we are delivering the best of iCapital to our clients.\nLead and participate in highly visible, cross-functional projects related to new offerings, client specific requests and regulatory changes.\nManage the client’s journey from initial onboarding, delivering best in class service and ensuring a smooth process for all key moments in the lifecycle.\nManage expectations effectively across all levels and deliver successful outcomes for issues that arise.\nCollaborate with internal teams to mitigate risks, improve processes, and influence strategic technology roadmaps to better serve our clients in the region.\nConsult with critical Fund Administrators to operationalize client specific nuances and fund events.\nOwn and drive our business unit’s strategy locally, while contributing to the achievement of the company’s goals.\n\nQualifications\n\n15+ years of experience in financial services, preferably in client service or investor relations -type roles in alternative investments\nCapable of thought leadership on topics such as client success and operational efficacy\nConsiderable experience leading and developing a growing team\nExperience with high-net-worth clients, financial advisors, and fund managers\nFamiliar with Canadian alternative fund structures and fund operations in Canada\nExcellent organizational skills and diligence\nExcellent interpersonal, written, and verbal communication skills\nAble to meet critical deadlines and work effectively under pressure\nAble to multi-task and work both independently and as a collaborator\nBachelor’s Degree in a related field\nFluent in French is a plus\n\nBenefits\nWe believe the best ideas and innovation happen when we are together. Employees in this role will work in the office Monday-Thursday, with the flexibility to work remotely on Friday.\niCapital offers a comprehensive benefits package that includes a competitive total compensation package consisting of salary, bonus, and equity for all full-time employees. The Company pays 100% of the premium for all Group Benefits for you and your dependents. Some of these benefits include medical, dental, vision, prescription, life insurance and long-term disability. We offer a variety of Retirement Plans so of which have a company match. We offer unlimited Paid Time Off (PTO) and most employees the flexibility to work in the office three to four days and remotely for the remainder of the week. Every department has different needs, and some positions will be designated in-office jobs, based on their function. For additional information on iCapital, please visit https://www.icapitalnetwork.com/about-us Twitter: @icapitalnetwork | LinkedIn: https://www.linkedin.com/company/icapital-network-inc Awards Disclaimer: https://www.icapitalnetwork.com/about-us/recognition/\niCapital is proud to support a fair and inclusive workplace, in which all applicants have an opportunity to fulfill their potential and every person has the right to equal treatment with respect to employment without discrimination. iCapital does not tolerate any discrimination contrary to the Ontario Human Rights Code, including on the grounds of race, ancestry, place of origin, colour, ethnic origin, citizenship, creed, sex, sexual orientation, gender identity, gender expression, age, record of offences, marital status, family status or disability.\n"
        },
        {
            "job_title": "Private Capital Fund Finance - Analyst ",
            "location": "Location: Toronto, Ontario, Canada",
            "description": "Fund Finance Hedge Funds – Analyst\nDepartment: Fund Finance \nLocation(s): Toronto\niCapital is powering the world’s alternative investment marketplace. Our financial technology platform has transformed how advisors, wealth management firms, asset managers, and banks evaluate and recommend bespoke public and private market strategies for their high-net-worth clients. iCapital services, approximately $218 billion in global client assets invested in 1,760 funds, as of January 2025.\niCapital has been named to the Forbes Fintech 50 for seven consecutive years (2018-2024); a three-time selection by Forbes to its list of Best Startup Employers (2021-2023); and a four-time winner of MMI/Barron’s Solutions Provider award (See link below).\n\nAbout the Role\niCapital is looking for the ideal candidate to join the Fund Finance team. This role will be part of our Accounting team which services a fast-growing sector of the business. This position will be responsible for servicing hedge and private equity fund of fund and access fund vehicles (the “funds”) in conjunction with third-party administrators. The ideal candidate will learn and work in a team that covers all fund accounting and financial reporting to investors, including capital activity, partner capital statements, annual audited financials, and tax deliverables.\n\nResponsibilities\n\nBuild and maintain relationships with clients, both distributors and underlying fund managers, fund administrators, and other service providers.\nWork closely with other iCapital internal teams such as Fund Origination, Investor Relations, Legal, Regulatory and Compliance, Technology, Sales, and Marketing to support ongoing fund operations.\nProvide review and control function for NAV packages, capital events, and management fee calculations provided by the fund administrator.\nMonitor cash positions and liquidity of investments, review cash reconciliations, and manage cash reserves.\nRun accounts payable and expense allocation processes.\nMaintain investor and investment data in the iCapital platform using proprietary technology tools.\nDefine, update, and maintain operating policies and procedures.\nLiaise with funds’ custodians and funds’ banks, as well as other counterparties as needed.\nFulfill ad-hoc requests.\n\n\nQualifications\n\nBachelor’s degree in Accounting, Finance or Economics\nInterest in learning fund accounting, fund administration, or finance operations for alternative investment funds including fund-of-funds and feeder funds\nAdvanced Excel skills\nWillingness to work within a close team structure on all tasks\nExcellent organizational skills and attention to detail\nAble to multi-task, and work both independently and as a team player in a fast-paced, demanding environment\nStrong verbal, written, and interpersonal communication skills\nHigh level of integrity\nPassion for the application of innovative technology\nEager to learn new topics and work in an evolving business environment\n\n\nBenefits\nWe believe the best ideas and innovation happen when we are together. Employees in this role will work in the office Monday-Thursday, with the flexibility to work remotely on Friday.\niCapital offers a comprehensive benefits package that includes a competitive total compensation package consisting of salary, bonus, and equity for all full-time employees. The Company pays 100% of the premium for all Group Benefits for you and your dependents. Some of these benefits include medical, dental, vision, prescription, life insurance and long-term disability. We offer a variety of Retirement Plans so of which have a company match. We offer unlimited Paid Time Off (PTO) and most employees the flexibility to work in the office three to four days and remotely for the remainder of the week. Every department has different needs, and some positions will be designated in-office jobs, based on their function. For additional information on iCapital, please visit https://www.icapitalnetwork.com/about-us Twitter: @icapitalnetwork | LinkedIn: https://www.linkedin.com/company/icapital-network-inc Awards Disclaimer: https://www.icapitalnetwork.com/about-us/recognition/\niCapital is proud to support a fair and inclusive workplace, in which all applicants have an opportunity to fulfill their potential and every person has the right to equal treatment with respect to employment without discrimination. iCapital does not tolerate any discrimination contrary to the Ontario Human Rights Code, including on the grounds of race, ancestry, place of origin, colour, ethnic origin, citizenship, creed, sex, sexual orientation, gender identity, gender expression, age, record of offences, marital status, family status or disability.\n"
        }
    ]
}